test/request-response-samples/GetSubscription__should_handle_ref_minOccurs_and_maxOccurs/request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:EVT="http://ws.gematik.de/conn/EventService/v7.2"
    xmlns:EVTW="http://ws.gematik.de/conn/EventService/WSDL/v7.2"
>
    <soap:Body>
        <EVT:GetSubscription xmlns:EVT="http://ws.gematik.de/conn/EventService/v7.2"
            xmlns="http://ws.gematik.de/conn/EventService/v7.2">
        </EVT:GetSubscription>
    </soap:Body>
</soap:Envelope>
